import { SupervisorName } from '../Project';

export const supervisorNames: SupervisorName[] = [
  {
    id: 3,
    fio: 'Серышева Ирина Анатольевна',
  },
  {
    id: 4,
    fio: 'Антипин Дмитрий Алексеевич',
  },
  {
    id: 5,
    fio: 'Антипина Оксана Викторовна',
  },
  {
    id: 6,
    fio: 'Бацюн Наталья Владимировна',
  },
  {
    id: 7,
    fio: 'Богатырева Марина Валерьевна',
  },
  {
    id: 8,
    fio: 'Вовсеенко Елена Александровна',
  },
  {
    id: 9,
    fio: 'Вязников Вадим Евгеньевич',
  },
  {
    id: 10,
    fio: 'Гафарова Елена Владиславовна',
  },
];
